locked.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-15 Wed 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What's outside of here?</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="styles.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">What's outside of here?</h1>
<p>
Writing computer code is a funny business, fundamentally an exercise
in taking a random walk across many abstract concepts to achieve some
more concretely defined goal. Different people will see this
'abstractness' in different ways. Personally, the only ground truth I
find is in the symbolic representation of programs that guide these
machines we call computers, but even that is a fiction in some
sense. <a href="https://en.wikipedia.org/wiki/Limits_of_computation">Symbol
and switching rates</a> do have physical limitations, so there is an
upper bound on the expressions of programs, but everything between
that and the act of naming things are ultimately figments of our
imagination. Some might even question
<a href="https://youtu.be/HB5TrK7A4pI?si=3AS4NDCyhEAXDoff">if we're all that
good at it anyway.</a>
</p>

<p>
I make this preface to highlight a sentiment I occasionally run
across, that there are easily discernable levels of abstraction in
programming and information technology in general, some more concrete
or 'real' than others. This quality of realism might even be mistaken
for objective truths of one matter or the other, to the point that our
software artifacts end up mutating our collective reality, or at least
skewing it to the point of appearing real.
</p>

<p>
It's my opinion that, it is the act of seeking the ultimate truth of
everything in these tools that leads us astray. I don't believe this
is an original thought, but seeing the rapid incursion of "AI" and
other algorithmic systems into our lives and the objects around us
gives me pause. Doctors take the hippocratic oath and generally
respect the limits of medicinal practice, but there are some overeager
technologists who seem to revel in the manifestation of their truth,
regardless of the consequences.
</p>

<p>
Our imagination's ability to manifest is both awe-inspiring and
terrific, and I think we owe it to ourselves to be even more
imaginative on the whole. I make no general prescription of what that
should look like, it would defeat the point. However, I think on the
whole we're digging a pretty complex rut that might be difficult to
get out of later.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-05-15 Wed 00:00</p>
<p class="author">Author: john</p>
<p class="date">Created: 2024-05-15 Wed 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
